In [1]:
import pandas as pd

In [3]:
coffees = pd.DataFrame({'Day':['Monday','Monday','Tuesday','Tuesday','Wednesday','Wednesday',
                              'Thursday','Thrusday','Friday','Friday','Saturday','Saturday','Sunday','Sunday'] , 
                              'Coffee Type' : ['Cortado','Latte','CAppuccino ','Mocha','Caffe machhiato','Cuban espresso','Espresso','Latte','Espresso',
                                                'Lattle','Flat white','Long Black','Espresso','Lattle'],
                              'Units Solid' : [25,15,30,20,35,25,40,30,45,35,45,50,55,60]

})

In [5]:
coffees.head()

         Day      Coffee Type  Units Solid
0     Monday          Cortado           25
1     Monday            Latte           15
2    Tuesday      CAppuccino            30
3    Tuesday            Mocha           20
4  Wednesday  Caffe machhiato           35

In [6]:
data = pd.DataFrame({'first' : ['subham' , 'Ravi','Mohan','Sohan','Gita'],
                     'last': ['kumar','kumar','Rai','raj','kumar']})

marge first and lasst name

In [7]:
data['first'] + ' ' + data['last']

0    subham kumar
1      Ravi kumar
2       Mohan Rai
3       Sohan raj
4      Gita kumar
dtype: object

vreate new column of full_name

In [57]:
data['full_name'] = data['first'] + data['last']

dispaly

In [58]:
data

    first   last    full_name
0  subham  kumar  subhamkumar
1    Ravi  kumar    Ravikumar
2   Mohan    Rai     MohanRai
3   Sohan    raj     Sohanraj
4    Gita  kumar    Gitakumar

In [59]:
data.drop(columns=['first','last'])

     full_name
0  subhamkumar
1    Ravikumar
2     MohanRai
3     Sohanraj
4    Gitakumar

In [60]:
data['full_name'].str.split( " , "  , expand=True)

             0
0  subhamkumar
1    Ravikumar
2     MohanRai
3     Sohanraj
4    Gitakumar

In [61]:
data

    first   last    full_name
0  subham  kumar  subhamkumar
1    Ravi  kumar    Ravikumar
2   Mohan    Rai     MohanRai
3   Sohan    raj     Sohanraj
4    Gita  kumar    Gitakumar

In [65]:
coffees.drop(index=[4,5,6,7,8])

         Day  Coffee Type  Units Solid
0     Monday      Cortado           25
1     Monday        Latte           15
2    Tuesday  CAppuccino            30
3    Tuesday        Mocha           20
9     Friday       Lattle           35
10  Saturday   Flat white           45
11  Saturday   Long Black           50
12    Sunday     Espresso           55
13    Sunday       Lattle           60

In [8]:
coffe = coffees['Day'] == 'saturday'
coffee.drop(index=coffe[coffe].index)

NameError: name 'coffee' is not defined